app/controllers/tasks_controller.rb

  def show
    unless @task = Task.find_by_id(params[:id])
---
SELECT title FROM `tasks` WHERE (`tasks`.`id` IS NULL) LIMIT 1

  def create
    @task = Task.new(params[:task])
      if @task.save
---
INSERT INTO `tasks` (`name`, `created_at`, `updated_at`, `description`) VALUES('Task 1', '2010-03-07 01:22:09', '2010-03-07 01:22:09', 'Phai lam viec trong ngay hom nay som')

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)

  def destroy
    @task = Task.find(params[:id])
    check_order_task = Task.check_task_before_delete(@task.id)
    if check_order_task.nil? && @task.destroy  # don't task should be handled after this task
---
SELECT * FROM `tasks` WHERE (order_id =3 and is_completed = 0) LIMIT 1
DELETE FROM `tasks` WHERE `id` = 1

  def update
    @task = Task.find(params[:id])
      if @task.update_attributes(params[:task])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)
UPDATE `tasks` SET `updated_at` = '2010-03-11 16:34:01', `is_completed` = 1, `title` = 'Chieu nay nghi hoc qua', `description` = 'thiet la chan qua di thoi ah' WHERE `id` = 9